app/controllers/aircraft_variants_controller.rb

SELECT "aircraft_variants".* FROM "aircraft_variants"
---
  def index
    variants = AircraftVariant.all

INSERT INTO "aircraft_variants" ("aircraft_family_id", "body_type", "created_at", "engine_type", "entry_into_service", "iata_code", "max_cargo_tonnes", "max_passengers", "name", "range_category", "range_km", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    variant = @family.aircraft_variants.new(variant_params)
    if variant.save

SELECT "aircraft_families".* FROM "aircraft_families" WHERE "aircraft_families"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_family
    @family = AircraftFamily.find(params[:family_id])

SELECT "aircraft_variants".* FROM "aircraft_variants" WHERE "aircraft_variants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_variant
    @variant = AircraftVariant.find(params[:id])