app/controllers/aircraft_families_controller.rb

INSERT INTO "aircraft_families" ("created_at", "manufacturer_id", "name", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["created_at", "2026-04-30 08:00:45.152761"], ["manufacturer_id", 1], ["name", "A320"], ["updated_at", "2026-04-30 08:00:45.152761"]]
---
  def create
    family = @manufacturer.aircraft_families.new(family_params)
    if family.save

SELECT "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_manufacturer
    @manufacturer = Manufacturer.find(params[:manufacturer_id])

SELECT "aircraft_families".* FROM "aircraft_families" WHERE "aircraft_families"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_family
    @family = AircraftFamily.find(params[:id])