app/controllers/airlines_controller.rb

SELECT "airlines".* FROM "airlines"
---
  def index
    airlines = Airline.all

INSERT INTO "airlines" ("country", "created_at", "iata_code", "name", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["country", "Germany"], ["created_at", "2026-04-30 08:00:45.225854"], ["iata_code", "LH"], ["name", "Lufthansa"], ["updated_at", "2026-04-30 08:00:45.225854"]]
---
  def create
    airline = Airline.new(airline_params)
    if airline.save

UPDATE "airlines" SET "name" = ?, "updated_at" = ? WHERE "airlines"."id" = ?  [["name", "Emirates Airlines"], ["updated_at", "2026-04-30 08:00:45.233910"], ["id", 1]]
---
  def update
    if @airline.update(airline_params)

DELETE FROM "airlines" WHERE "airlines"."id" = ?  [["id", 1]]
---
  def destroy
    @airline.destroy!

SELECT "airlines".* FROM "airlines" WHERE "airlines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_airline
    @airline = Airline.find(params[:id])