app/controllers/fleet_entries_controller.rb

INSERT INTO "fleet_entries" ("aircraft_variant_id", "airline_id", "avg_age_years", "created_at", "fleet_count", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    entry = @airline.fleet_entries.new(fleet_entry_params)
    if entry.save

UPDATE "fleet_entries" SET "avg_age_years" = ?, "fleet_count" = ?, "updated_at" = ? WHERE "fleet_entries"."id" = ?  [["avg_age_years", 6.1], ["fleet_count", 75], ["updated_at", "2026-04-30 08:00:45.272767"], ["id", 1]]
---
  def update
    if @fleet_entry.update(fleet_entry_params)

DELETE FROM "fleet_entries" WHERE "fleet_entries"."id" = ?  [["id", 1]]
---
  def destroy
    @fleet_entry.destroy!

SELECT "airlines".* FROM "airlines" WHERE "airlines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_airline
    @airline = Airline.find(params[:airline_id])

SELECT "fleet_entries".* FROM "fleet_entries" WHERE "fleet_entries"."airline_id" = ? AND "fleet_entries"."id" = ? LIMIT ?  [["airline_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_fleet_entry
    @fleet_entry = @airline.fleet_entries.find(params[:id])