app/controllers/manufacturers_controller.rb

  def index
    manufacturers = Manufacturer.all
---
SELECT "manufacturers".* FROM "manufacturers"

  def create
    manufacturer = Manufacturer.new(manufacturer_params)
    if manufacturer.save
---
INSERT INTO "manufacturers" ("country", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["country", "France"], ["created_at", "2026-04-30 08:00:45.288426"], ["name", "Airbus"], ["updated_at", "2026-04-30 08:00:45.288426"]]

  def update
    if @manufacturer.update(manufacturer_params)
---
UPDATE "manufacturers" SET "name" = ?, "updated_at" = ? WHERE "manufacturers"."id" = ?  [["name", "Boeing Co."], ["updated_at", "2026-04-30 08:00:45.295020"], ["id", 1]]

  def destroy
    @manufacturer.destroy!
---
DELETE FROM "manufacturers" WHERE "manufacturers"."id" = ?  [["id", 1]]

  def set_manufacturer
    @manufacturer = Manufacturer.find(params[:id])
---
SELECT "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]